import artSanderImg from '../images/projects/artsander/artsander.jpg';
import modelImg from '../images/projects/model-portfolio/model-portfolio.jpg';
import zatyshnaImg from '../images/projects/zatyshna/zatyshna.jpg';
import artamonovaImg from '../images/projects/artamonova/artamonova.png';
import pikhotskaaImg from '../images/projects/yuliiapikhotska/yuliiapikhotska.png';
import zefirImg from '../images/projects/zefirni-bukety/zefirni-bukety.png';
import kavaMedovaImg from '../images/projects/kava-medova/kava-medova.png';

import zatyshnaDesktopImg from '../images/projects/zatyshna/zatyshna-desktop.png';

export const projects = [
  {
    id: 1,
    projectName: 'Школа Zatyshna',
    about: 'сайт онлайн-школи англійської мови у форматі старовинного замку',
    image: zatyshnaImg,
    tabletImg: zatyshnaImg,
    mobileImg: zatyshnaImg,
    desktopImg: zatyshnaDesktopImg,
    type: 'Креативний корпоративний сайт',
    industry: 'Освіта',
    link: 'https://zatyshna.netlify.app/',
    description: [
      'Проєкт базувався на сміливій ідеї засновниці школи: відійти від стандартних шаблонів і створити сайт у вигляді старовинного замку, віртуального простору, де кожна вежа – це окремий етап знайомства зі школою. Моїм завданням було втілити цю візуальну метафору в життя, зберігши при цьому зручність користування (UX) та швидкість завантаження. \n\n Виклик від замовника: Поєднати атмосферу затишного ретро-замку з сучасним бізнес-інструментом. Головна складність полягала в реалізації нестандартної навігації — користувач має «подорожувати» вежами замку, які відповідають основним розділам меню',
    ],
    solution: [
      ' Концептуальна архітектура: Я реалізував ідею «навігації по вежах», де кожен архітектурний елемент замку є точкою входу в розділи: Про школу, Уроки, Продукти та Контакти. Це дозволило створити ігровий досвід (gamification) для відвідувача вже з першої секунди.  \n\n Від атмосфери до конверсії: Попри складний візуальний концепт, я зберіг чітку структуру продажу. Користувач не просто розглядає замок, він проходить шлях від зацікавленості («А що в цій вежі?») до цільової дії — запису на заняття.\n\n Впровадження ідеї: Я виконала повний цикл реалізації: від технічного опрацювання візуальних елементів замку до налаштування інтуїтивно зрозумілого інтерфейсу, щоб креатив не заважав функціональності.',
    ],
    feedback: '',
    brief:
      'Створення креативного сайту з унікальною візуальною метафорою старовинного замку. Головним завданням було інтегрувати нестандартну навігацію, зберігши при цьому високу швидкість завантаження та зручність користування.',
    focus: 'Нестандартна навігація',
    conclusion:
      'Проєкт став доказом того, що сміливий креатив може бути ефективним бізнес-інструментом. Нам вдалося втілити концепцію віртуальної подорожі вежами замку, зберігши при цьому UX та логіку інтерфейсу.',
    stats: {
      performance: 95,
      accessibility: 90,
      bestPractices: 96,
      seo: 100,
    },
  },
  {
    id: 2,
    projectName: 'Портфоліо моделі',
    about: 'Персональне портфоліо фото-моделі',
    image: modelImg,
    tabletImg: modelImg,
    mobileImg: modelImg,
    desktopImg: modelImg,
    type: 'Сайт-портфоліо',
    industry: 'Модельний бізнес',
    repo: 'https://github.com/OlenaPobehailo/tetianaandronenko',
    link: 'https://tetianaandronenko.vercel.app/',
    description: [
      "Проєкт, де головним викликом було створення «невидимого» дизайну. Основний запит замовниці –  мінімалізм, де жоден елемент інтерфейсу не відволікає увагу від головного: погляду, емоції та професійного кадру. Проблема замовника: Традиційні соцмережі або перевантажені портфоліо-платформи створюють «візуальний шум». Замовниці був потрібен власний простір, який би транслював спокій, впевненість та високий рівень професіоналізму. Потрібно було об'єднати велику кількість професійного контенту так, щоб сайт залишався легким, «повітряним» та швидко завантажувався.",
    ],
    solution: [
      'Філософія «Нічого зайвого». Ми відмовилися від складних анімацій та яскравих акцентів на користь вільного простору (whitespace) та витонченої типографіки. Візуальний фокус: Структура сайту побудована таким чином, щоб акцентувати увагу на професіоналізму Тетяни як моделі. Фотографії інтегровані в інтерфейс так, що сам сайт сприймається як цифрова артгалерея. Лаконічнийи інструмент самопрезентації, сайт став ідеальним рішенням для показу портфоліо агентствам та брендам, де чистота подачі контенту є ознакою високого класу',
    ],
    feedback: '',
    brief:
      'Розробка цифрового портфоліо з акцентом на принципах функціонального мінімалізму. Інтерфейс спроєктований як цифрова артгалерея, де вільний простір та витончена типографіка підкреслюють професійний стиль моделі, не відволікаючи від головного — контенту.',
    focus: 'Мінімалізм і Візуальний контент',
    conclusion:
      'У результаті було створено легкий і зосереджений простір для самопрезентації. Сайт став ефективною альтернативою соцмережам і платформам портфоліо, забезпечуючи чисту подачу, швидку роботу та відчуття професійної впевненості.',
    stats: {
      performance: 94,
      accessibility: 100,
      bestPractices: 100,
      seo: 91,
    },
  },
  {
    id: 3,
    projectName: 'Портфоліо режисера відеомонтажу',
    about:
      'Це персональний цифровий простір майстра відеопродакшну. Оскільки у сфері монтажу перші секунди перегляду вирішують долю контракту, сайт було створено як динамічний, візуально насичений інструмент. Головна мета — миттєво занурити відвідувача в естетику та ритм робіт автора, демонструючи високий рівень технічних навичок та творчого бачення.',
    image: artSanderImg,
    tabletImg: artSanderImg,
    mobileImg: artSanderImg,
    desktopImg: artSanderImg,
    type: 'Професійне сайт-портфоліо режисера відеомонтажу',
    industry: 'Відеовиробництво',
    link: 'https://artsander.vercel.app/',
    description: [
      'Проблема замовника: Для режисера монтажу важливо мати платформу, де відео не втрачає в якості (як це буває у соцмережах) і де увага глядача не розсіюється на зайві елементи. Олександру (Artsander) був потрібен «цифровий шоурум», який би структурував його різнопланові роботи — від динамічної реклами до складних творчих проєктів — і презентував їх великим брендам та продакшн-студіям.',
    ],
    solution: [
      'Відеоцентрична архітектура: Я розробив інтерфейс, де контент є головним елементом. Використання фонових відео-прев’ю та мінімалістичного дизайну дозволило створити ефект «живого» сайту, який дихає творчістю. Оптимізація досвіду: Робота з великою кількістю відео вимагає ідеальної швидкості завантаження. Я реалізував рішення, які дозволяють миттєво відтворювати контент без затримок («фрізів»), що критично важливо для утримання уваги професійних замовників. Логіка конверсії: Замість складних текстових описів — фокус на візуальних кейсах. Чітка структура меню та прямий вихід на контакти скорочують шлях від «мені подобається цей стиль» до «я хочу замовити монтаж».',
    ],
    feedback: '',
    brief:
      'Персональний шоурум майстра відеопродакшну, орієнтований на миттєве занурення в естетику автора. Сайт дозволяє переглядати важкий контент без затримок, презентуючи професійний рівень монтажу великим брендам та студіям.',
    focus: 'Швидкість відеовантаження.',
    conclusion:
      'Результатом став динамічний «цифровий шоурум», де технічна швидкість відповідає ритму відеопродукції. Сайт миттєво занурює глядача в роботу автора, забезпечуючи бездоганне відтворення важкого контенту без жодних затримок.',
    stats: {
      performance: 100,
      accessibility: 97,
      bestPractices: 100,
      seo: 100,
    },
  },
  {
    id: 4,
    projectName: 'Лендинг для таргетолога',
    about:
      'Сайт маркетингового експерта, створений для демонстрації експертності через призму бізнес-показників. У ніші, де довіра до спеціаліста є вирішальною, цей проєкт слугує і візиткою, і повноцінною точкою конверсії. Головне завдання сайту – перетворити холодного відвідувача на лояльного клієнта, показуючи рекламу не як витрати, а як інвестицію в ріст бізнесу',
    image: artamonovaImg,
    tabletImg: artamonovaImg,
    mobileImg: artamonovaImg,
    desktopImg: artamonovaImg,
    type: 'Лендинг для маркетингового експерта',
    industry: 'Маркетинг',
    link: 'https://artamonova.vercel.app',
    description: [
      'Проблема замовника: Спеціалісти з таргетованої реклами часто стикаються з проблемою «знеособленості» та низької довіри клієнтів через велику кількість новачків на ринку. Тетяні був потрібен інструмент, який би виділив її системний підхід, аналітичний склад розуму та здатність працювати на результат, а не просто «натискати кнопки» в рекламному кабінеті.',
    ],
    solution: [
      'Ми зробили акцент на психології довіри: Кожен блок сайту послідовно закриває заперечення клієнта: «Чи розуміє вона мою нішу?», «Які результати я отримаю?», «Як саме будується робота?». Чистий спокійний дизайн підсвічує впевненість та структурність Юлії як спеціаліста. Сайт став фундаментом для масштабування її власної практики, дозволяючи презентувати свою роботу на професійному рівні',
    ],
    feedback: '',
    brief:
      'Проєкт маркетингового експерта, створений для демонстрації системного аналітичного підходу. Дизайн послідовно закриває заперечення клієнтів та транслює впевненість фахівця, перетворюючи сторінку на ефективний інструмент для генерації лідів.',
    focus: 'Конверсія та довіра',
    conclusion:
      'Проєкт успішно транслює системний підхід та аналітичну глибину фахівця. Кожен блок сайту працює на зміцнення довіри, перетворюючи сторінку з простої візитки на надійний фундамент для масштабування практики експерта.',
    stats: {
      performance: 98,
      accessibility: 98,
      bestPractices: 100,
      seo: 100,
    },
  },
  {
    id: 5,
    projectName: 'Сайт-візитка психолога',
    about:
      'Проєкт для дипломованого психолога, чия діяльність базується на етичності, безперервному навчанні та глибинній роботі з особистістю. Основна ідея сайту – створити безпечний та структурований простір, де людина у стані тривоги чи невизначеності може миттєво відчути професіоналізм та підтримку фахівця ще до початку першої консультації.',
    image: pikhotskaaImg,
    tabletImg: pikhotskaaImg,
    mobileImg: pikhotskaaImg,
    desktopImg: pikhotskaaImg,
    type: 'Професійний сайт-візитка психолога',
    industry: 'Приватна практика',
    link: 'https://yuliiapikhotska.com',
    description: [
      'Проблема замовника: Психологія – сфера найвищої довіри. Юлія мала потребу в інструменті, який би не просто перелічував її дипломи, а транслював її цінності та методи роботи (інтегративний підхід, гештальт, арт-терапія тощо). Важливо було структурувати великий перелік запитів (від адаптації в еміграції до роботи з самооцінкою) так, щоб клієнт міг легко знайти свою проблему та зрозуміти шлях її вирішення.',
    ],
    solution: [
      'Архітектура довіри: Сторінка веде відвідувача від знайомства з фахівцем та його кваліфікацією (блоку навчання та сертифікатів) до конкретних результатів через відгуки та блок FAQ. Це знімає первинний страх перед зверненням до психолога. Емпатичний дизайн: Візуальне оформлення та подача інформації працюють на створення атмосфери спокою та врівноваженості. Інструментарій для клієнта: Впроваджено функціонал швидкого запису на консультацію, а також інтеграцію з месенджерами. Сайт став надійним фундаментом для  зміцнення особистого бренду, демонструючи високий рівень експертності та турботи про клієнта.',
    ],
    feedback: '',
    brief:
      'Створення персонального цифрового простору, що транслює спокій та професіоналізм. Головним завданням було побудувати довіру з першого екрана та максимально спростити шлях пацієнта до запису на консультацію',
    focus: 'Довіра та зручність запису',
    conclusion:
      'Сайт побудований як простір довіри, де дизайн підтримує відчуття спокою та безпеки. Він інформує про послуги і м’яко супроводжує клієнта від першого запиту до рішення записатися на консультацію.',
    stats: {
      performance: 99,
      accessibility: 95,
      bestPractices: 96,
      seo: 100,
    },
  },
  {
    id: 6,
    projectName: 'Авторська майстерня зефірної флористики',
    about:
      'Проєкт для майстрині зефірної флористики, головною метою якого було структурувати творчий хаос соціальних мереж у професійний інструмент продажу. Сайт фокусується на демонстрації можливостей та стилів, допомагаючи клієнту визначитися з вибором ще до моменту першого повідомлення майстру.',
    type: 'Landing page з каталогом',
    industry: 'Авторська кондитерська',
    image: zefirImg,
    tabletImg: zefirImg,
    mobileImg: zefirImg,
    desktopImg: zefirImg,
    link: 'https://zefirni-bukety.vercel.app',
    description: [
      'Проблема замовника: Основний канал продажів (Instagram) перестав справлятися з функцією каталогу. Клієнтам незручно шукати в десятках постів. Потрібно розробити інтерфейс, щоб відображались всі товари, а також сортування, фільтрація та пошук. ',
    ],
    solution: [
      'Навігація за запитами: Замість хронологічної стрічки (як в соцмережах), я на сайті реалізовані фільтри за категоріями. Тепер відповіді на питання «Які бувають квіти?» та «Що є, крім букетів?» клієнт отримує самостійно через зручні розділи каталогу. Сайт слугує бібліотекою ідей. Клієнт приходить у месенджер уже з конкретним запитом. Це скорочує час консультації в 3-4 рази. Естетичний мінімалізм: Оскільки продукт дуже деталізований та ніжний, я розробив дизайн, який не перетягує увагу на себе. Повітряна верстка та велика кількість вільного простору підкреслюють преміальність продукту та професійність автора. Сайт став ефективним посередником, який «прогріває» клієнта та демонструє експертність, дозволяючи замовниці фокусуватися виключно на творчості та виконанні замовлень',
    ],
    feedback: '',
    brief:
      'Розробка зручного каталогу для майстерні авторської кондитерської. Проєкт вирішує проблему навігації в асортименті через систему фільтрів та категорій, що підкреслює преміальність продукту та суттєво скорочує час на консультування клієнтів.',
    focus: 'Навігація за категоріями',
    conclusion:
      'Перехід від невпорядкованості Instagram-стрічки до структурованого каталогу радикально змінює взаємодію з клієнтами. Сайт має стати ефективним фільтром запитів, який економить час власника та підкреслює преміальність авторського продукту',
    stats: {
      performance: 99,
      accessibility: 95,
      bestPractices: 100,
      seo: 100,
    },
  },
  {
    id: 7,
    projectName: 'Медова кава',
    about:
      'Проєкт для нішевого закладу, де кава поєднується з медовою естетикою. Коли бізнес фокусується на атмосфері та візуальному контенті в Instagram, йому потрібен професійний «місток» між пошуковим запитом клієнта та соціальними мережами. Цей сайт став саме таким інструментом — лаконічним, стильним та спрямованим на одну конкретну дію.',
    image: kavaMedovaImg,
    tabletImg: kavaMedovaImg,
    mobileImg: kavaMedovaImg,
    desktopImg: kavaMedovaImg,
    type: 'Сайт-визитка концептуальної кав’ярні',
    industry: "Кав'ярня",
    link: 'https://kava-medova.vercel.app',
    description: [
      'Проблема замовника: Кав’ярня активно веде Instagram, але не мала власної сторінки в мережі. Було важливо мати просте рішення, яке б закривало базові потреби: показувало локацію, передавало настрій закладу та слугувало професійною візиткою, яку можна додати в опис профілю чи на карти. Потрібен був мінімалістичний майданчик, що не потребує складного адміністрування.',
    ],
    solution: [
      'Передача атмосфери через візуал: Оскільки на сайті мінімум тексту, ставка зроблена на колірну гаму та шрифти, що асоціюються з кавою та медом. Це дозволяє відчути заклад ще до візиту. Сторінка має декілька кнопок переходу в Instagram, де і відбувається основне життя бренду. Гнучкість на майбутнє: Хоча на даному етапі сайт працює як візитка, у нього закладена можливість масштабування. Якщо замовник вирішить додати меню, систему лояльності чи анонси подій – технічний фундамент готовий. Сайт успішно виконує роль цифрової презентації, підкреслюючи унікальність концепції «Kava Medova»',
    ],
    feedback: '',
    conclusion: '',
    brief:
      'Мінімалістичний сайт-візитка, що слугує професійним містком між пошуком і соціальними мережами закладу. Сайт знайомить із кав’ярнею, передає її настрій і спрямовує відвідувача до соціальних мереж.',
    focus: 'Локація та Instagram',
    stats: {
      performance: 96,
      accessibility: 85,
      bestPractices: 100,
      seo: 100,
    },
  },
];
