import {
  artamonovaImgDesktop,
  artamonovaImgMobile,
  artamonovaImgTablet,
  artsanderImg,
  artsanderImgDesktop,
  artsanderImgMobile,
  artsanderImgTablet,
  kavaMedovaImgDesktop,
  kavaMedovaImgMobile,
  kavaMedovaImgTablet,
  modelImg,
  modelImgMobile,
  modelImgTablet,
  pikhotskaaImgDesktop,
  pikhotskaaImgMobile,
  pikhotskaaImgTablet,
  zatyshnaImg,
  zatyshnaImgDesktop,
  zatyshnaImgMobile,
  zatyshnaImgTablet,
  zefirImgDesktop,
  zefirImgMobile,
  zefirImgTablet,
} from '../images/projects';

import artamonovaImg from '../images/projects/artamonova/artamonova.png';
import pikhotskaaImg from '../images/projects/yuliiapikhotska/yuliiapikhotska.png';
import zefirImg from '../images/projects/zefirni-bukety/zefirni-bukety.png';
import kavaMedovaImg from '../images/projects/kava-medova/kava-medova.png';

import { Project } from '@/app/interfaces/interfaces';

export const projects: Project[] = [
  {
    id: 1,
    projectName: 'Школа Zatyshna',
    about: 'Сайт онлайн-школи англійської мови у форматі старовинного замку',
    image: zatyshnaImg,
    desktopImg: zatyshnaImgDesktop,
    tabletImg: zatyshnaImgTablet,
    mobileImg: zatyshnaImgMobile,
    industry: 'Освіта',
    type: 'Концептуальний багатосторінковий лендинг',
    focus: 'Нестандартна навігація, візуальна метафора',
    brief:
      'Створення креативного сайту з унікальною візуальною метафорою старовинного замку. Головним завданням було інтегрувати нестандартну навігацію, зберігши при цьому високу швидкість завантаження та зручність користування.',
    challenge: [
      'Завданням було поєднати складну естетику старовинного замку з функціональністю сучасного бізнес-інструменту. Головною складністю було реалізувати навігацію через «вежі замку» так, щоб це не заплутало відвідувача та не сповільнило роботу сайту. ',
    ],
    solution: [
      'Реалізувана ідею «навігації по вежах», де кожен архітектурний елемент замку є точкою входу в розділи: Про школу, Уроки, Продукти та Контакти. Це дозволило створити ігровий досвід для відвідувача.  \n\n Користувач проходить шлях від зацікавленості («А що в цій вежі?») до цільової дії — запису на заняття',
    ],
    conclusion:
      'Проєкт став доказом того, що сміливий креатив може бути ефективним бізнес-інструментом. Нам вдалося втілити концепцію віртуальної подорожі вежами замку, зберігши при цьому UX та логіку інтерфейсу.',
    feedback: [''],
    stats: {
      performance: 95,
      accessibility: 90,
      bestPractices: 96,
      seo: 100,
    },
    link: 'https://zatyshna.netlify.app/',
  },
  {
    id: 2,
    projectName: 'Портфоліо моделі',
    about:
      'Персональне портфоліо фото-моделі з фокусом на візуальний контент та зручну навігацію',
    image: modelImg,
    desktopImg: modelImg,
    tabletImg: modelImgTablet,
    mobileImg: modelImgMobile,
    industry: 'Модельний бізнес',
    type: 'Сайт-портфоліо',
    focus: 'Мінімалізм і Візуальний контент',
    brief:
      'Розробка цифрового портфоліо з акцентом на принципах функціонального мінімалізму. Інтерфейс спроєктований як цифрова артгалерея, що підкреслює професійний стиль моделі, не відволікаючи  від головного — контенту.',
    challenge: [
      "Основний запит замовниці –  мінімалізм, де жоден елемент інтерфейсу не відволікає увагу від головного: погляду, емоції та професійного кадру. Потрібно було об'єднати велику кількість професійного контенту так, щоб сайт залишався легким та швидко завантажувався, і водночас додати інструмент, який би допомагав у навігації, не перевантажуючи візуальний ряд ",
    ],
    solution: [
      'Ми відмовилися від складних анімацій та яскравих акцентів на користь вільного простору. На мобільних екранах впроваджено функціонал «плаваючої» навігаційної стрілки. Вона з’являється лише тоді, коли користувач починає рух галереєю, і дозволяє одним кліком переміститися до початку (меню/контакти) або в кінець сторінки \n\n Сайт двомовний (українська та англійська мови).',
    ],
    conclusion:
      'У результаті було створено легкий і зосереджений простір для самопрезентації. Сайт став ефективною альтернативою соцмережам і платформам портфоліо, забезпечуючи чисту подачу, швидку роботу та відчуття професійної впевненості.',
    feedback: [''],
    stats: {
      performance: 94,
      accessibility: 100,
      bestPractices: 100,
      seo: 91,
    },
    link: 'https://tetianaandronenko.vercel.app/',
  },
  {
    id: 3,
    projectName: 'Портфоліо режисера відеомонтажу',
    about:
      'Лаконічне портфоліо режисера монтажу з акцентом на швидкий доступ до відео та мінімалістичний дизайн.',
    image: artsanderImg,
    desktopImg: artsanderImgDesktop,
    tabletImg: artsanderImgTablet,
    mobileImg: artsanderImgMobile,
    industry: 'Відеовиробництво',
    type: 'Професійне сайт-портфоліо режисера відеомонтажу',
    focus: 'Швидкість вантаження відео.',
    brief:
      'Персональний професійна платформа майстра відеомонажу, де інтерфейс не відволікає від контенту, а відео відкриваються максимально зручно на будь-якому пристрої.',
    challenge: [
      'Специфіка роботи режисера монтажу вимагає демонстрації великої кількості відео високої якості. Головний виклик — забезпечити екстремальну швидкість завантаження сторінки, щоб потенційний роботодавець не чекав завантаження. Також потрібно було вирішити конфлікт UX: на десктопі дати відчуття кінотеатру, а на смартфоні забезпечити швидкий вертикальний скролінг без випадкових запусків «важких» файлів.',
    ],
    solution: [
      'Використання фонових відео-прев’ю та мінімалістичного дизайну. Робота з великою кількістю відео вимагає ідеальної швидкості завантаження. На десктопній версії реалізовано відтворення відео в модальному вікні: при кліку на роботу фон затемнюється, створюючи фокус на відео. Для мобільних пристроях ми відмовилися від попапів на користь прямого вбудовування в потік сторінки, що спростило взаємодію.',
    ],
    conclusion:
      'Результатом став сайт, де технічна швидкість відповідає ритму відеопродукції. Швидкість роботи сайту підкреслює професійний підхід режисера до технічних деталей, а лаконічний інтерфейс дозволяє роботам говорити самі за себе.',
    feedback: [''],
    stats: {
      performance: 100,
      accessibility: 97,
      bestPractices: 100,
      seo: 100,
    },
    link: 'https://artsander.vercel.app/',
  },
  {
    id: 4,
    projectName: 'Лендинг для таргетолога',
    about:
      'Персональний сайт таргетолога з акцентом на аналітичний підхід, логіку та юридичний бекграунд фахівця.',
    image: artamonovaImg,
    desktopImg: artamonovaImgDesktop,
    tabletImg: artamonovaImgTablet,
    mobileImg: artamonovaImgMobile,
    industry: 'Маркетинг / Таргетована реклама',
    type: 'Персональний сайт-візитка',
    focus: 'Системність, логіка, лаконічний дизайн',
    challenge: [
      'Спеціалісти з таргетованої реклами часто стикаються з проблемою низької довіри клієнтів через велику кількість новачків у професії. Був потрібен інструмент, який би виділив системний підхід, аналітичний склад розуму та здатність працювати на результат. Складність полягала в тому, щоб структурувати велику кількість послуг (різні тарифи, ніші, етапи) так, щоб сторінка не перетворилася на нескінченне полотно тексту.',
    ],
    solution: [
      'Використані інтерактивні таби для блоку послуг. Це дозволило згорнути великі масиви даних у зручні вкладки, де користувач бачить лише те, що його цікавить у цей момент. Етапи роботи були візуалізовані як чіткий алгоритм, що підсвідомо зчитується як «юридична точність». Кейси реалізовані у форматі модальних вікон із внутрішніми галереями, що дозволило вмістити детальні результати реклами, не роздуваючи основну сторінку.',
    ],
    brief:
      'Проєкт маркетингового експерта, створений для демонстрації системного аналітичного підходу. Дизайн послідовно закриває заперечення клієнтів та транслює впевненість фахівця, перетворюючи сторінку на ефективний інструмент для генерації лідів.',
    conclusion:
      'Проєкт успішно транслює системний підхід та аналітичну глибину фахівця. Кожен блок сайту працює на зміцнення довіри, перетворюючи сторінку з простої візитки на надійний фундамент для масштабування практики експерта.',
    feedback: [''],
    stats: {
      performance: 98,
      accessibility: 98,
      bestPractices: 100,
      seo: 100,
    },
    link: 'https://artamonova.vercel.app',
  },
  {
    id: 5,
    projectName: 'Сайт-візитка психолога',
    about:
      "Персональний сайт дипломованого психолога з акцентом на професійну етику, інтегративний підхід та підтримку ментального здоров'я",
    image: pikhotskaaImg,
    desktopImg: pikhotskaaImgDesktop,
    tabletImg: pikhotskaaImgTablet,
    mobileImg: pikhotskaaImgMobile,
    industry: 'Психологія',
    type: 'Професійний сайт-візитка психолога',
    focus: 'Довіра, професійна етика',
    brief:
      'Завданням проєкту було сформувати відчуття довіри та безпеки з перших секунд взаємодії із сайтом. Важливо було закрити ключові страхи потенційного клієнта: експертність терапевта, етичність і безпеку процесу, а також здатність спеціаліста зрозуміти індивідуальний запит.',
    challenge: [
      'Психологія – сфера найвищої довіри. Потрібно було органічно поєднати суто професійну інформацію (дипломи, супервізії) з емпатичним контентом.',
    ],
    solution: [
      'Сторінка веде відвідувача від знайомства з фахівцем та його кваліфікацією (блоку навчання та сертифікатів) до конкретних результатів через відгуки та блок FAQ. Візуальне оформлення та подача інформації працюють на створення атмосфери спокою та врівноваженості. Впроваджено функціонал швидкого запису на консультацію, а також інтеграцію з месенджерами.',
    ],
    conclusion:
      'Сайт побудований як простір довіри, де дизайн підтримує відчуття спокою та безпеки. Він інформує про послуги і м’яко супроводжує клієнта поєднуючи професійність із відчуттям підтримки та етичності.',
    feedback: [''],
    stats: {
      performance: 99,
      accessibility: 95,
      bestPractices: 96,
      seo: 100,
    },
    link: 'https://yuliiapikhotska.com',
  },
  {
    id: 6,
    projectName: 'Авторська майстерня зефірної флористики',
    about:
      'Проєкт для майстрині зефірної флористики, головною метою якого було структурувати творчий хаос соціальних мереж у професійний інструмент продажу. Сайт фокусується на демонстрації можливостей та стилів, допомагаючи клієнту визначитися з вибором ще до моменту першого повідомлення майстру.',
    image: zefirImg,
    desktopImg: zefirImgDesktop,
    tabletImg: zefirImgTablet,
    mobileImg: zefirImgMobile,
    industry: 'Авторська кондитерська',
    type: 'Landing page з каталогом',
    focus: 'Навігація за категоріями',
    brief:
      'Розробка зручного каталогу для майстерні авторської кондитерської. Проєкт вирішує проблему навігації в асортименті через систему фільтрів та категорій, що підкреслює преміальність продукту та суттєво скорочує час на консультування клієнтів.',
    challenge: [
      'Проблема замовника: Основний канал продажів (Instagram) перестав справлятися з функцією каталогу. Клієнтам незручно шукати в десятках постів. Потрібно розробити інтерфейс, щоб відображались всі товари, а також сортування, фільтрація та пошук. ',
    ],
    solution: [
      'Навігація за запитами: Замість хронологічної стрічки (як в соцмережах), я на сайті реалізовані фільтри за категоріями. Тепер відповіді на питання «Які бувають квіти?» та «Що є, крім букетів?» клієнт отримує самостійно через зручні розділи каталогу. Сайт слугує бібліотекою ідей. Клієнт приходить у месенджер уже з конкретним запитом. Це скорочує час консультації в 3-4 рази. Естетичний мінімалізм: Оскільки продукт дуже деталізований та ніжний, я розробив дизайн, який не перетягує увагу на себе. Повітряна верстка та велика кількість вільного простору підкреслюють преміальність продукту та професійність автора. Сайт став ефективним посередником, який «прогріває» клієнта та демонструє експертність, дозволяючи замовниці фокусуватися виключно на творчості та виконанні замовлень',
    ],
    conclusion:
      'Перехід від невпорядкованості Instagram-стрічки до структурованого каталогу радикально змінює взаємодію з клієнтами. Сайт має стати ефективним фільтром запитів, який економить час власника та підкреслює преміальність авторського продукту',
    feedback: [''],
    stats: {
      performance: 99,
      accessibility: 95,
      bestPractices: 100,
      seo: 100,
    },
    link: 'https://zefirni-bukety.vercel.app',
  },
  {
    id: 7,
    projectName: 'Медова кава',
    about:
      'Лаконічна вебвізитка затишної кав’ярні, основним майданчиком якої є Instagram.',
    image: kavaMedovaImg,
    desktopImg: kavaMedovaImgDesktop,
    tabletImg: kavaMedovaImgTablet,
    mobileImg: kavaMedovaImgMobile,
    industry: "Кав'ярня",
    type: 'Сайт-визитка концептуальної кав’ярні',
    focus: 'Мінімалізм, локація та Instagram',
    brief:
      'Мінімалістичний сайт-візитка, що слугує професійним містком між пошуком і соціальними мережами закладу. Сайт знайомить із кав’ярнею, передає її настрій і спрямовує відвідувача до соціальних мереж.',
    challenge: [
      'Кав’ярня активно веде Instagram, але не мала власної сторінки в мережі. Було важливо мати просте рішення, яке б закривало базові потреби: показувало локацію, передавало настрій закладу та слугувало професійною візиткою, яку можна додати в опис профілю чи на карти.',
    ],
    solution: [
      'Оскільки на сайті мінімум тексту, ставка зроблена на колірну гаму та шрифти, що асоціюються з кавою та медом. Сторінка має декілька кнопок переходу в Instagram, де і відбувається основне життя бренду. Хоча на даному етапі сайт працює як візитка, у нього закладена можливість масштабування. Якщо замовник вирішить додати меню, систему лояльності чи анонси подій – технічний фундамент готовий. Сайт успішно виконує роль цифрової презентації, підкреслюючи унікальність концепції Медової Кави',
    ],
    conclusion: 'Заклад отримав офіційне представництво в мережі, що покращило його видимість у Google Maps та пошуку.',
    feedback: [''],
    stats: {
      performance: 96,
      accessibility: 85,
      bestPractices: 100,
      seo: 100,
    },
    link: 'https://kava-medova.vercel.app',
  },
];
