import artSanderImg from './images/projects/artsander.jpg';
import modelImg from './images/projects/model-portfolio.jpg';
import zatyshnaImg from './images/projects/zatyshna.jpg';
import artamonovaImg from './images/projects/artamonova.png';
import pikhotskaaImg from './images/projects/yuliiapikhotska.png';
import zefirImg from './images/projects/zefirni-bukety-1.png';
import kavaMedovaImg from './images/projects/kava-medova.png';

export const projects = [
  {
    id: 1,
    projectName: 'Zatyshna',
    about: 'сайт онлайн-школи англійської мови у форматі старовинного замку',
    image: zatyshnaImg,
    type: 'Креативний корпоративний сайт з унікальною системою навігації',
    livePage: 'https://zatyshna.netlify.app/',
    description: [
      'Проєкт базувався на сміливій ідеї засновниці школи: відійти від стандартних шаблонів і створити сайт у вигляді старовинного замку, віртуального простору, де кожна вежа – це окремий етап знайомства зі школою. Моїм завданням було втілити цю візуальну метафору в життя, зберігши при цьому зручність користування (UX) та швидкість завантаження. \n\n Виклик від замовника: Поєднати атмосферу затишного ретро-замку з сучасним бізнес-інструментом. Головна складність полягала в реалізації нестандартної навігації — користувач має «подорожувати» вежами замку, які відповідають основним розділам меню',
    ],
    solution: [
      ' Концептуальна архітектура: Я реалізував ідею «навігації по вежах», де кожен архітектурний елемент замку є точкою входу в розділи: Про школу, Уроки, Продукти та Контакти. Це дозволило створити ігровий досвід (gamification) для відвідувача вже з першої секунди.  \n\n Від атмосфери до конверсії: Попри складний візуальний концепт, я зберіг чітку структуру продажу. Користувач не просто розглядає замок, він проходить шлях від зацікавленості («А що в цій вежі?») до цільової дії — запису на заняття.\n\n Впровадження ідеї: Я виконала повний цикл реалізації: від технічного опрацювання візуальних елементів замку до налаштування інтуїтивно зрозумілого інтерфейсу, щоб креатив не заважав функціональності.',
    ],
  },
  {
    id: 2,
    projectName: 'Персональне портфоліо моделі',
    about: 'Портфоліо моделі',
    image: modelImg,
    type: 'Сайт-портфоліо / Естетична візитка експерта',
    repo: 'https://github.com/OlenaPobehailo/tetianaandronenko',
    livePage: 'https://tetianaandronenko.vercel.app/',
    description: [
      "Проєкт, де головним викликом було створення «невидимого» дизайну. Основний запит замовниці –  мінімалізм, де жоден елемент інтерфейсу не відволікає увагу від головного: погляду, емоції та професійного кадру. Проблема замовника: Традиційні соцмережі або перевантажені портфоліо-платформи створюють «візуальний шум». Замовниці був потрібен власний простір, який би транслював спокій, впевненість та високий рівень професіоналізму. Потрібно було об'єднати велику кількість професійного контенту так, щоб сайт залишався легким, «повітряним» та швидко завантажувався.",
    ],
    solution: [
      'Філософія «Нічого зайвого»: Я розробив концепцію, що базується на принципах функціонального мінімалізму. Ми відмовилися від складних анімацій та яскравих акцентів на користь вільного простору (whitespace) та витонченої типографіки. Візуальний фокус: Структура сайту побудована таким чином, щоб акцентувати увагу на професіоналізму Тетяни як моделі. Фотографії інтегровані в інтерфейс так, що сам сайт сприймається як цифрова артгалерея. Лаконічнийи інструмент самопрезентації, сайт став ідеальним рішенням для показу портфоліо агентствам та брендам, де чистота подачі контенту є ознакою високого класу',
    ],
  },
  {
    id: 3,
    projectName: 'Портфоліо режисера відеомонтажу',
    about:
      'Це персональний цифровий простір майстра відеопродакшну. Оскільки у сфері монтажу перші секунди перегляду вирішують долю контракту, сайт було створено як динамічний, візуально насичений інструмент. Головна мета — миттєво занурити відвідувача в естетику та ритм робіт автора, демонструючи високий рівень технічних навичок та творчого бачення.',
    image: artSanderImg,
    type: 'Професійне сайт-портфоліо режисера відеомонтажу',
    livePage: 'https://artsander.vercel.app/',
    description: [
      'Проблема замовника: Для режисера монтажу важливо мати платформу, де відео не втрачає в якості (як це буває у соцмережах) і де увага глядача не розсіюється на зайві елементи. Олександру (Artsander) був потрібен «цифровий шоурум», який би структурував його різнопланові роботи — від динамічної реклами до складних творчих проєктів — і презентував їх великим брендам та продакшн-студіям.',
    ],
    solution: [
      'Відеоцентрична архітектура: Я розробив інтерфейс, де контент є головним елементом. Використання фонових відео-прев’ю та мінімалістичного дизайну дозволило створити ефект «живого» сайту, який дихає творчістю. Оптимізація досвіду: Робота з великою кількістю відео вимагає ідеальної швидкості завантаження. Я реалізував рішення, які дозволяють миттєво відтворювати контент без затримок («фрізів»), що критично важливо для утримання уваги професійних замовників. Логіка конверсії: Замість складних текстових описів — фокус на візуальних кейсах. Чітка структура меню та прямий вихід на контакти скорочують шлях від «мені подобається цей стиль» до «я хочу замовити монтаж».',
    ],
  },
  {
    id: 4,
    projectName: 'Лендинг для маркетингового експерта',
    about:
      'Сайт таргетолога, створений для демонстрації експертності через призму бізнес-показників. У ніші, де довіра до спеціаліста є вирішальною, цей проєкт слугує і візиткою, і повноцінною точкою конверсії. Головне завдання сайту – перетворити холодного відвідувача на лояльного клієнта, показуючи рекламу не як витрати, а як інвестицію в ріст бізнесу',
    image: artamonovaImg,
    type: 'Лендинг для маркетингового експерта',
    livePage: 'https://artamonova.vercel.app',
    description: [
      'Проблема замовника: Спеціалісти з таргетованої реклами часто стикаються з проблемою «знеособленості» та низької довіри клієнтів через велику кількість новачків на ринку. Тетяні був потрібен інструмент, який би виділив її системний підхід, аналітичний склад розуму та здатність працювати на результат, а не просто «натискати кнопки» в рекламному кабінеті.',
    ],
    solution: [
      'Ми зробили акцент на психології довіри: Кожен блок сайту послідовно закриває заперечення клієнта: «Чи розуміє вона мою нішу?», «Які результати я отримаю?», «Як саме будується робота?». Чистий спокійний дизайн підсвічує впевненість та структурність Юлії як спеціаліста. Сайт став фундаментом для масштабування її власної практики, дозволяючи презентувати свою роботу на професійному рівні',
    ],
  },
  {
    id: 5,
    projectName: 'Професійний сайт-візитка психолога',
    about:
      'Проєкт для дипломованого психолога, чия діяльність базується на етичності, безперервному навчанні та глибинній роботі з особистістю. Основна ідея сайту – створити безпечний та структурований простір, де людина у стані тривоги чи невизначеності може миттєво відчути професіоналізм та підтримку фахівця ще до початку першої консультації.',
    image: pikhotskaaImg,
    type: 'Професійний сайт-візитка психолога',
    livePage: 'https://yuliiapikhotska.com',
    description: [
      'Проблема замовника: Психологія – сфера найвищої довіри. Юлія мала потребу в інструменті, який би не просто перелічував її дипломи, а транслював її цінності та методи роботи (інтегративний підхід, гештальт, арт-терапія тощо). Важливо було структурувати великий перелік запитів (від адаптації в еміграції до роботи з самооцінкою) так, щоб клієнт міг легко знайти свою проблему та зрозуміти шлях її вирішення.',
    ],
    solution: [
      'Архітектура довіри: Сторінка веде відвідувача від знайомства з фахівцем та його кваліфікацією (блоку навчання та сертифікатів) до конкретних результатів через відгуки та блок FAQ. Це знімає первинний страх перед зверненням до психолога. Емпатичний дизайн: Візуальне оформлення та подача інформації працюють на створення атмосфери спокою та врівноваженості. Інструментарій для клієнта: Впроваджено функціонал швидкого запису на консультацію, а також інтеграцію з месенджерами. Сайт став надійним фундаментом для  зміцнення особистого бренду, демонструючи високий рівень експертності та турботи про клієнта.',
    ],
  },
  {
    id: 6,
    projectName: 'Авторська майстерня зефірної флористики',
    type: 'Landing page з каталогом',
    about:
      'Проєкт для майстрині зефірної флористики, головною метою якого було структурувати творчий хаос соціальних мереж у професійний інструмент продажу. Сайт фокусується на демонстрації можливостей та стилів, допомагаючи клієнту визначитися з вибором ще до моменту першого повідомлення майстру.',
    image: zefirImg,
    livePage: 'https://zefirni-bukety.vercel.app',
    description: [
      'Проблема замовника: Основний канал продажів (Instagram) перестав справлятися з функцією каталогу. Клієнтам незручно шукати в десятках постів. Потрібно розробити інтерфейс, щоб відображались всі товари, а також сортування, фільтрація та пошук. ',
    ],
    solution: [
      'Навігація за запитами: Замість хронологічної стрічки (як в соцмережах), я на сайті реалізовані фільтри за категоріями. Тепер відповіді на питання «Які бувають квіти?» та «Що є, крім букетів?» клієнт отримує самостійно через зручні розділи каталогу. Сайт слугує бібліотекою ідей. Клієнт приходить у месенджер уже з конкретним запитом. Це скорочує час консультації в 3-4 рази. Естетичний мінімалізм: Оскільки продукт дуже деталізований та ніжний, я розробив дизайн, який не перетягує увагу на себе. Повітряна верстка та велика кількість вільного простору підкреслюють преміальність продукту та професійність автора. Сайт став ефективним посередником, який «прогріває» клієнта та демонструє експертність, дозволяючи замовниці фокусуватися виключно на творчості та виконанні замовлень',
    ],
  },
  {
    id: 7,
    projectName: 'Кава медова',
    about:
      'Проєкт для нішевого закладу, де кава поєднується з медовою естетикою. Коли бізнес фокусується на атмосфері та візуальному контенті в Instagram, йому потрібен професійний «місток» між пошуковим запитом клієнта та соціальними мережами. Цей сайт став саме таким інструментом — лаконічним, стильним та спрямованим на одну конкретну дію.',
    image: kavaMedovaImg,
    type: 'Сайт-визитка концептуальної кав’ярні',
    livePage: 'https://kava-medova.vercel.app',
    description: [
      'Проблема замовника: Кав’ярня активно веде Instagram, але не мала власної сторінки в мережі. Було важливо мати просте рішення, яке б закривало базові потреби: показувало локацію, передавало настрій закладу та слугувало професійною візиткою, яку можна додати в опис профілю чи на карти. Потрібен був мінімалістичний майданчик, що не потребує складного адміністрування.',
    ],
    solution: [
      'Передача атмосфери через візуал: Оскільки на сайті мінімум тексту, ставка зроблена на колірну гаму та шрифти, що асоціюються з кавою та медом. Це дозволяє відчути заклад ще до візиту. Сторінка має декілька кнопок переходу в Instagram, де і відбувається основне життя бренду. Гнучкість на майбутнє: Хоча на даному етапі сайт працює як візитка, у нього закладена можливість масштабування. Якщо замовник вирішить додати меню, систему лояльності чи анонси подій – технічний фундамент готовий. Сайт успішно виконує роль цифрової презентації, підкреслюючи унікальність концепції «Kava Medova»',
    ],
  },
];
