export const testimonials = [
    {
        quote: [
            "Олено, хочу подякувати за роботу над моїм лендінгом!",
            "Весь процес співпраці був максимально комфортним: уважне ставлення до деталей, швидкий зворотний зв’язок і професійний підхід на кожному етапі. Дизайн сучасний, функціонал зручний, усе працює бездоганно. Дуже ціную те, що всі мої побажання були враховані, а також отримав корисні рекомендації щодо покращення сайту.",
            "Результатом дуже задоволений, буду рекомендувати усім, хто шукає якісну веб- розробку!",
        ],
        author: "Олександр",
        position: "Режисер відео-монатажу",
    },
    {
        quote: [
            "Дуже вдячна за сайт для нашої школи! ",
            "Просто неймовірно гарний дизайн, функціонал, все працює швидко та чітко!",
            "Чесно, я не думала, що взагалі можливо втілити те, що я собі придумала… але ви зробили неможливе 🥺💗Дякую!!",
            "Дуже рекомендую усім, хто хоче якість та стиль 🤌🏻"
        ],
        author: "Олександра",
        position: "Засновниця школи",
    },
    {
        quote: [
            "Олено, хочу подякувати тобі за чудову роботу над моїм сайтом!",
            "Ти уважно вислухала всі мої побажання, врахувала бажаний стиль і створила сучасний, естетичний та зручний сайт. Дизайн виглядає професійно, привабливо для очей і, що важливо, відповідає моєму позиціонуванню як таргетолога ☺️",
        ],
        author: "Юлія",
        position: "Таргетолог",
    },
    {
        quote:
            "Дякую вам Олено, за вашу працю. Окрема подяка за те що прислуховуєтеся до побажань клієнтів і якщо треба щось переробити або доробити завжди йдете на зустріч з вами було легко працювати, дякую за розуміння тому що це був мій перший досвід в створенні сайту. Бажаю вам багато вдячних клієнтів",
        author: "Ірина",
        position: "Зефірний флорист",
    },
    {
        quote: [
            "Олено, хочу подякувати за роботу над моїм лендінгом!",
            "Весь процес співпраці був максимально комфортним: уважне ставлення до деталей, швидкий зворотний зв’язок і професійний підхід на кожному етапі. Дизайн сучасний, функціонал зручний, усе працює бездоганно. Дуже ціную те, що всі мої побажання були враховані, а також отримав корисні рекомендації щодо покращення сайту.",
            "Результатом дуже задоволений, буду рекомендувати усім, хто шукає якісну веб- розробку!",
        ],
        author: "Олександр",
        position: "Режисер відео-монатажу",
    },
    {
        quote: [
            "Дуже вдячна за сайт для нашої школи! ",
            "Просто неймовірно гарний дизайн, функціонал, все працює швидко та чітко!",
            "Чесно, я не думала, що взагалі можливо втілити те, що я собі придумала… але ви зробили неможливе 🥺💗Дякую!!",
            "Дуже рекомендую усім, хто хоче якість та стиль 🤌🏻"
        ],
        author: "Олександра",
        position: "Засновниця школи",
    },
    {
        quote: [
            "Олено, хочу подякувати тобі за чудову роботу над моїм сайтом!",
            "Ти уважно вислухала всі мої побажання, врахувала бажаний стиль і створила сучасний, естетичний та зручний сайт. Дизайн виглядає професійно, привабливо для очей і, що важливо, відповідає моєму позиціонуванню як таргетолога ☺️",
        ],
        author: "Юлія",
        position: "Таргетолог",
    },
    {
        quote:
            "Дякую вам Олено, за вашу працю. Окрема подяка за те що прислуховуєтеся до побажань клієнтів і якщо треба щось переробити або доробити завжди йдете на зустріч з вами було легко працювати, дякую за розуміння тому що це був мій перший досвід в створенні сайту. Бажаю вам багато вдячних клієнтів",
        author: "Ірина",
        position: "Зефірний флорист",
    },
];
